{"id":"paper_1733778000000","title":"Snakes survive starvation by employing supply- and demand-side economic strategies","authors":"Marshall D. McCue","journal":"Zoology","year":"2007","doi":"10.1016/j.zool.2007.02.004","url":"https://www.sciencedirect.com/science/article/pii/S0944200607000372","keyAssumptions":"Traditional metabolic theory assumes fixed metabolic rates; Starvation survival primarily about energy storage; Limited focus on dynamic metabolic regulation","citation":"McCue, M. D. (2007). Snakes survive starvation by employing supply-and demand-side economic strategies. Zoology, 110(4), 318-327.","notes":"Revolutionary paper demonstrating snakes can depress metabolic rate by 72% and employ dual supply/demand strategies. Studied Python regius, Elaphe obsoleta, Crotalus atrox over 168 days.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000001","title":"Characterization of the gila monster (Heloderma suspectum suspectum) venom proteome","authors":"Kristian W. Sanggaard, Thomas F. Dyrlund, Line R. Thomsen, Tania A. Nielsen, Lars Brøndum, Tobias Wang, Ida B. Thøgersen, Jan J. Enghild","journal":"Journal of Proteomics","year":"2015","doi":"10.1016/j.jprot.2015.01.014","url":"https://pubmed.ncbi.nlm.nih.gov/25603280/","keyAssumptions":"Helodermatid venom composition relatively simple; Focus on known peptide toxins; Bioactive peptides activated intracellularly","citation":"Sanggaard, K. W., Dyrlund, T. F., Thomsen, L. R., Nielsen, T. A., Brøndum, L., Wang, T., ... & Enghild, J. J. (2015). Characterization of the gila monster (Heloderma suspectum suspectum) venom proteome. Journal of proteomics, 117, 1-11.","notes":"First comprehensive proteome analysis identifying 39 proteins in Gila monster venom, including 19 previously unknown. Revealed post-secretion activation mechanism for exendins via neuroendocrine convertase.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000002","title":"Exendin-4 from Heloderma suspectum venom: From discovery to its latest application as type II diabetes combatant","authors":"Michelle Khai Khun Yap, Nurhamimah Misuan","journal":"Basic & Clinical Pharmacology & Toxicology","year":"2019","doi":"10.1111/bcpt.13169","url":"https://pubmed.ncbi.nlm.nih.gov/30417596/","keyAssumptions":"Synthetic drugs superior to natural compounds; Venom compounds primarily toxic; Short-acting incretin mimetics sufficient","citation":"Yap, M. K. K., & Misuan, N. (2019). Exendin‐4 from Heloderma suspectum venom: From discovery to its latest application as type II diabetes combatant. Basic & clinical pharmacology & toxicology, 124(5), 513-527.","notes":"Comprehensive review of exendin-4 discovery and development. 53% homology with GLP-1 but superior potency and DPP-IV resistance. Led to FDA approval of exenatide as first GLP-1 receptor agonist.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000003","title":"Release of exendin-4 is controlled by mechanical action in Gila monsters, Heloderma suspectum","authors":"Carolyn M. Christel, Dale F. DeNardo","journal":"Comparative Biochemistry and Physiology Part A","year":"2006","doi":"10.1016/j.cbpa.2005.09.007","url":"https://pubmed.ncbi.nlm.nih.gov/16321550/","keyAssumptions":"Venom compounds only released during defensive biting; Exendin-4 serves purely predatory function; Hormone release from salivary glands unusual in reptiles","citation":"Christel, C. M., & DeNardo, D. F. (2006). Release of exendin-4 is controlled by mechanical action in Gila monsters, Heloderma suspectum. Comparative Biochemistry and Physiology Part A: Molecular & Integrative Physiology, 143(1), 85-88.","notes":"First evidence that exendin-4 release is mechanically controlled and may serve endocrine function in fuel homeostasis. Represents first example of salivary gland hormone secretion in reptiles.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000004","title":"Exendin-4 decelerates food intake, weight gain, and fat deposition in Zucker rats","authors":"Malgorzata Szayna, Maire E. Doyle, Jennifer A. Betkey, Harold W. Holloway, Richard G.S. Spencer, Nigel H. Greig, Josephine M. Egan","journal":"Endocrinology","year":"2000","doi":"10.1210/endo.141.6.7490","url":"https://academic.oup.com/endo/article-lookup/doi/10.1210/endo.141.6.7490","keyAssumptions":"Diabetes drugs should focus primarily on glucose control; Weight management requires separate interventions; Appetite suppression distinct from glucose regulation","citation":"Szayna, M., Doyle, M. E., Betkey, J. A., Holloway, H. W., Spencer, R. G. S., Greig, N. H., & Egan, J. M. (2000). Exendin-4 decelerates food intake, weight gain, and fat deposition in Zucker rats. Endocrinology, 141(6), 1936-1941.","notes":"Landmark study demonstrating dual benefits of exendin-4: glucose control and significant appetite suppression/weight loss. 14-day study in Zucker fatty rats showing immediate food intake reduction and sustained weight loss.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000005","title":"A model of optimal digestive strategy in infrequently-feeding snakes","authors":"Graeme D. Ruxton","journal":"Evolutionary Ecology","year":"2025","doi":"10.1007/s10682-024-10328-x","url":"https://link.springer.com/article/10.1007/s10682-024-10328-x","keyAssumptions":"Infrequently-feeding snakes benefit only from large prey; Gut downregulation not quantitatively modeled; Size determines optimal prey choice","citation":"Ruxton, G. D. (2025). A model of optimal digestive strategy in infrequently-feeding snakes. Evolutionary Ecology, 39, 37-56.","notes":"Mathematical model challenging long-held assumptions. Demonstrates that infrequently-feeding snakes of all sizes benefit from small prey consumption when practicing gut downregulation. Identifies gut downregulation as critical adaptation for food scarcity.","addedDate":"2025-08-09T20:30:00Z"}