{"id":"paper_1733778000000","title":"Snakes survive starvation by employing supply- and demand-side economic strategies","authors":"Marshall D. McCue","journal":"Zoology","year":"2007","doi":"10.1016/j.zool.2007.02.004","url":"https://www.sciencedirect.com/science/article/pii/S0944200607000372","keyAssumptions":"Traditional metabolic theory assumes fixed metabolic rates; Starvation survival primarily about energy storage; Limited focus on dynamic metabolic regulation","citation":"McCue, M. D. (2007). Snakes survive starvation by employing supply-and demand-side economic strategies. Zoology, 110(4), 318-327.","notes":"Revolutionary paper demonstrating snakes can depress metabolic rate by 72% and employ dual supply/demand strategies. Studied Python regius, Elaphe obsoleta, Crotalus atrox over 168 days.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000001","title":"Characterization of the gila monster (Heloderma suspectum suspectum) venom proteome","authors":"Kristian W. Sanggaard, Thomas F. Dyrlund, Line R. Thomsen, Tania A. Nielsen, Lars Brøndum, Tobias Wang, Ida B. Thøgersen, Jan J. Enghild","journal":"Journal of Proteomics","year":"2015","doi":"10.1016/j.jprot.2015.01.014","url":"https://pubmed.ncbi.nlm.nih.gov/25603280/","keyAssumptions":"Helodermatid venom composition relatively simple; Focus on known peptide toxins; Bioactive peptides activated intracellularly","citation":"Sanggaard, K. W., Dyrlund, T. F., Thomsen, L. R., Nielsen, T. A., Brøndum, L., Wang, T., ... & Enghild, J. J. (2015). Characterization of the gila monster (Heloderma suspectum suspectum) venom proteome. Journal of proteomics, 117, 1-11.","notes":"First comprehensive proteome analysis identifying 39 proteins in Gila monster venom, including 19 previously unknown. Revealed post-secretion activation mechanism for exendins via neuroendocrine convertase.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000002","title":"Exendin-4 from Heloderma suspectum venom: From discovery to its latest application as type II diabetes combatant","authors":"Michelle Khai Khun Yap, Nurhamimah Misuan","journal":"Basic & Clinical Pharmacology & Toxicology","year":"2019","doi":"10.1111/bcpt.13169","url":"https://pubmed.ncbi.nlm.nih.gov/30417596/","keyAssumptions":"Synthetic drugs superior to natural compounds; Venom compounds primarily toxic; Short-acting incretin mimetics sufficient","citation":"Yap, M. K. K., & Misuan, N. (2019). Exendin‐4 from Heloderma suspectum venom: From discovery to its latest application as type II diabetes combatant. Basic & clinical pharmacology & toxicology, 124(5), 513-527.","notes":"Comprehensive review of exendin-4 discovery and development. 53% homology with GLP-1 but superior potency and DPP-IV resistance. Led to FDA approval of exenatide as first GLP-1 receptor agonist.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000003","title":"Release of exendin-4 is controlled by mechanical action in Gila monsters, Heloderma suspectum","authors":"Carolyn M. Christel, Dale F. DeNardo","journal":"Comparative Biochemistry and Physiology Part A","year":"2006","doi":"10.1016/j.cbpa.2005.09.007","url":"https://pubmed.ncbi.nlm.nih.gov/16321550/","keyAssumptions":"Venom compounds only released during defensive biting; Exendin-4 serves purely predatory function; Hormone release from salivary glands unusual in reptiles","citation":"Christel, C. M., & DeNardo, D. F. (2006). Release of exendin-4 is controlled by mechanical action in Gila monsters, Heloderma suspectum. Comparative Biochemistry and Physiology Part A: Molecular & Integrative Physiology, 143(1), 85-88.","notes":"First evidence that exendin-4 release is mechanically controlled and may serve endocrine function in fuel homeostasis. Represents first example of salivary gland hormone secretion in reptiles.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000004","title":"Exendin-4 decelerates food intake, weight gain, and fat deposition in Zucker rats","authors":"Malgorzata Szayna, Maire E. Doyle, Jennifer A. Betkey, Harold W. Holloway, Richard G.S. Spencer, Nigel H. Greig, Josephine M. Egan","journal":"Endocrinology","year":"2000","doi":"10.1210/endo.141.6.7490","url":"https://academic.oup.com/endo/article-lookup/doi/10.1210/endo.141.6.7490","keyAssumptions":"Diabetes drugs should focus primarily on glucose control; Weight management requires separate interventions; Appetite suppression distinct from glucose regulation","citation":"Szayna, M., Doyle, M. E., Betkey, J. A., Holloway, H. W., Spencer, R. G. S., Greig, N. H., & Egan, J. M. (2000). Exendin-4 decelerates food intake, weight gain, and fat deposition in Zucker rats. Endocrinology, 141(6), 1936-1941.","notes":"Landmark study demonstrating dual benefits of exendin-4: glucose control and significant appetite suppression/weight loss. 14-day study in Zucker fatty rats showing immediate food intake reduction and sustained weight loss.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000005","title":"A model of optimal digestive strategy in infrequently-feeding snakes","authors":"Graeme D. Ruxton","journal":"Evolutionary Ecology","year":"2025","doi":"10.1007/s10682-024-10328-x","url":"https://link.springer.com/article/10.1007/s10682-024-10328-x","keyAssumptions":"Infrequently-feeding snakes benefit only from large prey; Gut downregulation not quantitatively modeled; Size determines optimal prey choice","citation":"Ruxton, G. D. (2025). A model of optimal digestive strategy in infrequently-feeding snakes. Evolutionary Ecology, 39, 37-56.","notes":"Mathematical model challenging long-held assumptions. Demonstrates that infrequently-feeding snakes of all sizes benefit from small prey consumption when practicing gut downregulation. Identifies gut downregulation as critical adaptation for food scarcity.","addedDate":"2025-08-09T20:30:00Z"}
{"id":"paper_1733778000006","title":"Drug Discovery and Development of Semaglutide and Tirzepatide from the Gila monsters (Heloderma spp)","authors":"Olimat M, AL-Olimat S","journal":"Medical & Clinical Research","year":"2025","doi":"10.33552/MCR.2025.10.003","url":"https://www.medclinrese.org/peer-review/drug-discovery-and-development-of-semaglutide-and-tirzepatide-from-the-gila-monsters-heloderma-spp-610.html","keyAssumptions":"Rational synthetic drug design is superior to natural products; Single-target drugs are preferable; Modern pharmaceuticals outperform natural evolution","citation":"Olimat, M., & AL-Olimat, S. (2025). Drug Discovery and Development of Semaglutide and Tirzepatide from the Gila monsters (Heloderma spp). Medical & Clinical Research, 10(3), 01-11.","notes":"Recent comprehensive review showing how Gila monster exendin-4 led to superior multi-mechanism drugs (semaglutide, tirzepatide) that outperform synthetic alternatives. Demonstrates natural evolution's optimization of complex multifunctional molecules for integrated pathway modulation.","addedDate":"2025-08-11T18:00:00Z"}
{"id":"paper_1733778000007","title":"Therapeutic Potential of Peptides Derived from Animal Venoms: Current Views and Emerging Drugs for Diabetes","authors":"Aimee Coulter-Parkhill, Stephen McClean, Victor A Gault, Nigel Irwin","journal":"Clinical Medicine Insights: Endocrinology and Diabetes","year":"2021","doi":"10.1177/11795514211006071","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC8491154/","keyAssumptions":"Venom peptides are primarily toxic; Limited therapeutic compounds in animal venoms; Synthetic alternatives are safer than natural derivatives","citation":"Coulter-Parkhill, A., McClean, S., Gault, V. A., & Irwin, N. (2021). Therapeutic Potential of Peptides Derived from Animal Venoms: Current Views and Emerging Drugs for Diabetes. Clinical Medicine Insights: Endocrinology and Diabetes, 14, 11795514211006071.","notes":"Systematic review establishing venom-derived peptides as legitimate pharmaceutical platform. Identifies multiple compounds in development beyond exendin-4, demonstrating broad therapeutic potential and need for systematic venom screening programs.","addedDate":"2025-08-11T18:00:00Z"}
{"id":"paper_1733778000008","title":"The consequences of seasonal fasting during the dormancy of tegu lizards (Salvator merianae) on their postprandial metabolic response","authors":"Rodrigo S B Gavira, Marina R Sartori, Manuel N Gontero-Fourcade, Bruna F Gomes, Augusto S Abe, Denis V Andrade","journal":"Journal of Experimental Biology","year":"2018","doi":"10.1242/jeb.176156","url":"https://journals.biologists.com/jeb/article/221/8/jeb176156/330/The-consequences-of-seasonal-fasting-during-the","keyAssumptions":"Fasting has negative effects on digestive capacity; Metabolic recovery follows predictable patterns; Dormancy is simple metabolic shutdown","citation":"Gavira, R. S. B., Sartori, M. R., Gontero-Fourcade, M. N., Gomes, B. F., Abe, A. S., & Andrade, D. V. (2018). The consequences of seasonal fasting during the dormancy of tegu lizards (Salvator merianae) on their postprandial metabolic response. Journal of Experimental Biology, 221(8), jeb176156.","notes":"Demonstrates that seasonal fasting during dormancy represents adaptive strategy that maintains digestive capacity while enabling energy conservation. Supports concept that reptilian fasting is active physiological strategy rather than passive starvation response.","addedDate":"2025-08-11T18:00:00Z"}
{"id":"paper_1733778000009","title":"Metabolic and digestive response to food ingestion in a binge-feeding lizard, the Gila monster (Heloderma suspectum)","authors":"C M Christel, D F DeNardo, S M Secor","journal":"Journal of Experimental Biology","year":"2007","doi":"10.1242/jeb.02947","url":"https://journals.biologists.com/jeb/article/210/19/3430/17094/Metabolic-and-digestive-response-to-food-ingestion","keyAssumptions":"Large meals impose high metabolic costs; Digestive efficiency is constant across feeding frequencies; Binge feeding is suboptimal foraging strategy","citation":"Christel, C. M., DeNardo, D. F., & Secor, S. M. (2007). Metabolic and digestive response to food ingestion in a binge-feeding lizard, the Gila monster (Heloderma suspectum). Journal of Experimental Biology, 210(19), 3430-3439.","notes":"Demonstrates unique metabolic and digestive adaptations that make binge feeding energetically efficient in Gila monsters. Shows extreme feeding strategies can be optimized through coordinated physiological adaptations, providing insights into desert survival mechanisms.","addedDate":"2025-08-11T18:00:00Z"}